Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-DA_DFP/1.1.98/atdf/PIC32MZ2064DAG169.atdf
         <register caption="CAN Acceptance Filter " name="C2RXF14" offset="0x1220" rw="RW" size="4">
            <bitfield caption="Extended Identifier bits" mask="0x0003FFFF" name="EID" values="C2RXF14__EID" />
            <bitfield caption="Extended Identifier Enable bits" mask="0x00080000" name="EXID" values="C2RXF14__EXID" />
            <bitfield caption="Standard Identifier bits" mask="0xFFE00000" name="SID" values="C2RXF14__SID" />
         </register>
         <register caption="CAN Acceptance Filter " name="C1RXF15" offset="0x230" rw="RW" size="4">
            <bitfield caption="Extended Identifier bits" mask="0x0003FFFF" name="EID" values="C1RXF15__EID" />
            <bitfield caption="Extended Identifier Enable bits" mask="0x00080000" name="EXID" values="C1RXF15__EXID" />
            <bitfield caption="Standard Identifier bits" mask="0xFFE00000" name="SID" values="C1RXF15__SID" />
         </register>
         <register caption="CAN Acceptance Filter " name="C2RXF15" offset="0x1230" rw="RW" size="4">
            <bitfield caption="Extended Identifier bits" mask="0x0003FFFF" name="EID" values="C2RXF15__EID" />
            <bitfield caption="Extended Identifier Enable bits" mask="0x00080000" name="EXID" values="C2RXF15__EXID" />
            <bitfield caption="Standard Identifier bits" mask="0xFFE00000" name="SID" values="C2RXF15__SID" />
         </register>
         <register caption="CAN Acceptance Filter " name="C1RXF16" offset="0x240" rw="RW" size="4">
            <bitfield caption="Extended Identifier bits" mask="0x0003FFFF" name="EID" values="C1RXF16__EID" />
            <bitfield caption="Extended Identifier Enable bits" mask="0x00080000" name="EXID" values="C1RXF16__EXID" />
            <bitfield caption="Standard Identifier bits" mask="0xFFE00000" name="SID" values="C1RXF16__SID" />
         </register>
         <register caption="CAN Acceptance Filter " name="C2RXF16" offset="0x1240" rw="RW" size="4">
            <bitfield caption="Extended Identifier bits" mask="0x0003FFFF" name="EID" values="C2RXF16__EID" />
            <bitfield caption="Extended Identifier Enable bits" mask="0x00080000" name="EXID" values="C2RXF16__EXID" />
            <bitfield caption="Standard Identifier bits" mask="0xFFE00000" name="SID" values="C2RXF16__SID" />
         </register>
         <register caption="CAN Acceptance Filter " name="C1RXF17" offset="0x250" rw="RW" size="4">
            <bitfield caption="Extended Identifier bits" mask="0x0003FFFF" name="EID" values="C1RXF17__EID" />
            <bitfield caption="Extended Identifier Enable bits" mask="0x00080000" name="EXID" values="C1RXF17__EXID" />
            <bitfield caption="Standard Identifier bits" mask="0xFFE00000" name="SID" values="C1RXF17__SID" />
         </register>
         <register caption="CAN Acceptance Filter " name="C2RXF17" offset="0x1250" rw="RW" size="4">
            <bitfield caption="Extended Identifier bits" mask="0x0003FFFF" name="EID" values="C2RXF17__EID" />
            <bitfield caption="Extended Identifier Enable bits" mask="0x00080000" name="EXID" values="C2RXF17__EXID" />
            <bitfield caption="Standard Identifier bits" mask="0xFFE00000" name="SID" values="C2RXF17__SID" />
         </register>
         <register caption="CAN Acceptance Filter " name="C1RXF18" offset="0x260" rw="RW" size="4">
            <bitfield caption="Extended Identifier bits" mask="0x0003FFFF" name="EID" values="C1RXF18__EID" />
            <bitfield caption="Extended Identifier Enable bits" mask="0x00080000" name="EXID" values="C1RXF18__EXID" />
            <bitfield caption="Standard Identifier bits" mask="0xFFE00000" name="SID" values="C1RXF18__SID" />
         </register>
         <register caption="CAN Acceptance Filter " name="C2RXF18" offset="0x1260" rw="RW" size="4">
            <bitfield caption="Extended Identifier bits" mask="0x0003FFFF" name="EID" values="C2RXF18__EID" />
            <bitfield caption="Extended Identifier Enable bits" mask="0x00080000" name="EXID" values="C2RXF18__EXID" />
            <bitfield caption="Standard Identifier bits" mask="0xFFE00000" name="SID" values="C2RXF18__SID" />
         </register>
         <register caption="CAN Acceptance Filter " name="C1RXF19" offset="0x270" rw="RW" size="4">
            <bitfield caption="Extended Identifier bits" mask="0x0003FFFF" name="EID" values="C1RXF19__EID" />
            <bitfield caption="Extended Identifier Enable bits" mask="0x00080000" name="EXID" values="C1RXF19__EXID" />
            <bitfield caption="Standard Identifier bits" mask="0xFFE00000" name="SID" values="C1RXF19__SID" />
         </register>
         <register caption="CAN Acceptance Filter " name="C2RXF19" offset="0x1270" rw="RW" size="4">
            <bitfield caption="Extended Identifier bits" mask="0x0003FFFF" name="EID" values="C2RXF19__EID" />
            <bitfield caption="Extended Identifier Enable bits" mask="0x00080000" name="EXID" values="C2RXF19__EXID" />
            <bitfield caption="Standard Identifier bits" mask="0xFFE00000" name="SID" values="C2RXF19__SID" />
         </register>
         <register caption="CAN Acceptance Filter " name="C1RXF20" offset="0x280" rw="RW" size="4">
            <bitfield caption="Extended Identifier bits" mask="0x0003FFFF" name="EID" values="C1RXF20__EID" />
            <bitfield caption="Extended Identifier Enable bits" mask="0x00080000" name="EXID" values="C1RXF20__EXID" />
            <bitfield caption="Standard Identifier bits" mask="0xFFE00000" name="SID" values="C1RXF20__SID" />
         </register>
         <register caption="CAN Acceptance Filter " name="C2RXF20" offset="0x1280" rw="RW" size="4">
            <bitfield caption="Extended Identifier bits" mask="0x0003FFFF" name="EID" values="C2RXF20__EID" />
            <bitfield caption="Extended Identifier Enable bits" mask="0x00080000" name="EXID" values="C2RXF20__EXID" />
            <bitfield caption="Standard Identifier bits" mask="0xFFE00000" name="SID" values="C2RXF20__SID" />
         </register>
