Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-DA_DFP/1.1.98/atdf/PIC32MZ2064DAG169.atdf
         <register caption="External Bus Interface Control Pin Configuration Register" name="CFGEBIC" offset="0xd0" rw="RW" size="4">
            <bitfield caption="EBI Data Upper Byte Pin Enable bit" mask="0x00000001" name="EBIDEN0" values="CFGEBIC__EBIDEN0" />
            <bitfield caption="EBI Data Upper Byte Pin Enable bit" mask="0x00000002" name="EBIDEN1" values="CFGEBIC__EBIDEN1" />
            <bitfield caption="EBICS0 Pin Enable bit" mask="0x00000010" name="EBICSEN0" values="CFGEBIC__EBICSEN0" />
            <bitfield caption="EBICS1 Pin Enable bit" mask="0x00000020" name="EBICSEN1" values="CFGEBIC__EBICSEN1" />
            <bitfield caption="EBICS2 Pin Enable bit" mask="0x00000040" name="EBICSEN2" values="CFGEBIC__EBICSEN2" />
            <bitfield caption="EBICS3 Pin Enable bit" mask="0x00000080" name="EBICSEN3" values="CFGEBIC__EBICSEN3" />
            <bitfield caption="EBIBS0 Pin Enable bit" mask="0x00000100" name="EBIBSEN0" values="CFGEBIC__EBIBSEN0" />
            <bitfield caption="EBIBS1 Pin Enable bit" mask="0x00000200" name="EBIBSEN1" values="CFGEBIC__EBIBSEN1" />
            <bitfield caption="EBIOE Pin Enable bit" mask="0x00001000" name="EBIOEEN" values="CFGEBIC__EBIOEEN" />
            <bitfield caption="EBIWE Pin Enable bit" mask="0x00002000" name="EBIWEEN" values="CFGEBIC__EBIWEEN" />
            <bitfield caption="EBIRP Pin Sensitivity Control bit" mask="0x00010000" name="EBIRPEN" values="CFGEBIC__EBIRPEN" />
            <bitfield caption="EBIRDYx Pin Sensitivity Control bit" mask="0x00020000" name="EBIRDYLVL" values="CFGEBIC__EBIRDYLVL" />
            <bitfield caption="EBIRDY1 Pin Enable bit" mask="0x02000000" name="EBIRDYEN1" values="CFGEBIC__EBIRDYEN1" />
            <bitfield caption="EBIRDY2 Pin Enable bit" mask="0x04000000" name="EBIRDYEN2" values="CFGEBIC__EBIRDYEN2" />
            <bitfield caption="EBIRDY3 Pin Enable bit" mask="0x08000000" name="EBIRDYEN3" values="CFGEBIC__EBIRDYEN3" />
            <bitfield caption="EBIRDY1 Inversion Control bit" mask="0x20000000" name="EBIRDYINV1" values="CFGEBIC__EBIRDYINV1" />
            <bitfield caption="EBIRDY2 Inversion Control bit" mask="0x40000000" name="EBIRDYINV2" values="CFGEBIC__EBIRDYINV2" />
            <bitfield caption="EBIRDY3 Inversion Control bit" mask="0x80000000" name="EBIRDYINV3" values="CFGEBIC__EBIRDYINV3" />
         </register>
         <register caption="Permission Group Configuration Register" name="CFGPG" offset="0xe0" rw="RW" size="4">
            <bitfield caption="CPU Permission Group bits" mask="0x00000003" name="CPUPG" values="CFGPG__CPUPG" />
            <bitfield caption="DMA Module Permission Group bits" mask="0x00000030" name="DMAPG" values="CFGPG__DMAPG" />
            <bitfield caption="USB Module Permission Group bits" mask="0x00000300" name="USBPG" values="CFGPG__USBPG" />
            <bitfield caption="CAN1 Module Permission Group bits" mask="0x00003000" name="CAN1PG" values="CFGPG__CAN1PG" />
            <bitfield caption="CAN2 Module Permission Group bits" mask="0x0000C000" name="CAN2PG" values="CFGPG__CAN2PG" />
            <bitfield caption="Ethernet Module Permission Group bits" mask="0x00030000" name="ETHPG" values="CFGPG__ETHPG" />
            <bitfield caption="Secure Digital Host Controller Permission Group bits" mask="0x000C0000" name="SDHCPG" values="CFGPG__SDHCPG" />
            <bitfield caption="SQI Module Permission Group bits" mask="0x00300000" name="SQI1PG" values="CFGPG__SQI1PG" />
            <bitfield caption="Flash Control Permission Group bits" mask="0x00C00000" name="FCPG" values="CFGPG__FCPG" />
            <bitfield caption="Crypto Engine Permission Group bits" mask="0x03000000" name="CRYPTPG" values="CFGPG__CRYPTPG" />
            <bitfield caption="Graphics LCD Controller Permission Group bits" mask="0x0C000000" name="GLCDPG" values="CFGPG__GLCDPG" />
            <bitfield caption="2D Graphics Processing Unit Permission Group bits" mask="0x30000000" name="GPUPG" values="CFGPG__GPUPG" />
            <bitfield mask="0xC0000000" name="ICD1PG" />
         </register>
         <register caption="Configuration Control Register 2" name="CFGCON2" offset="0xf0" rw="RW" size="4">
            <bitfield caption="GPU Reset Bit" mask="0x00000001" name="GPURESET" values="CFGCON2__GPURESET" />
            <bitfield caption="SDWPPOL" mask="0x00000004" name="SDWPPOL" values="CFGCON2__SDWPPOL" />
            <bitfield caption="SDHC Read FIFO Threshold bits" mask="0x00003FF0" name="SDRDFTHR" />
            <bitfield caption="SDHC Write FIFO Threshold bits" mask="0x03FF0000" name="SDWRFTHR" />
            <bitfield caption="SD card Write Protect Enable bit" mask="0x10000000" name="SDWPEN" values="CFGCON2__SDWPEN" />
            <bitfield caption="SD Card Detect Pin Enable bit" mask="0x20000000" name="SDCDEN" values="CFGCON2__SDCDEN" />
            <bitfield caption="Graphics Display Mode bit" mask="0x40000000" name="GLCDMODE" values="CFGCON2__GLCDMODE" />
            <bitfield caption="Graphics Display Pin Enable bit" mask="0x80000000" name="GLCDPINEN" values="CFGCON2__GLCDPINEN" />
         </register>
         <register caption="Memory PLL Configuration Register" name="CFGMPLL" offset="0x100" rw="RW" size="4" initval="0x0B001901">
            <bitfield caption="MPLL Input Divider bits" mask="0x0000003F" name="MPLLIDIV" values="CFGMPLL__MPLLIDIV" />
            <bitfield caption="Internal DDRV" mask="0x000000C0" name="INTVREFCON" values="CFGMPLL__INTVREFCON" />
            <bitfield caption="MPLL Multiplier bits" mask="0x0000FF00" name="MPLLMULT" values="CFGMPLL__MPLLMULT" />
            <bitfield caption="MPLL Voltage regulator Disable bit" mask="0x00400000" name="MPLLVREGDIS" values="CFGMPLL__MPLLVREGDIS" />
            <bitfield caption="MPLL Voltage Regulator Ready bit" mask="0x00800000" name="MPLLVREGRDY" values="CFGMPLL__MPLLVREGRDY" />
            <bitfield caption="MPLL Output Divider 1 bits" mask="0x07000000" name="MPLLODIV1" values="CFGMPLL__MPLLODIV1" />
            <bitfield caption="MPLL Output Divider 2 bits" mask="0x38000000" name="MPLLODIV2" values="CFGMPLL__MPLLODIV2" />
            <bitfield caption="MPLL Disable bit" mask="0x40000000" name="MPLLDIS" values="CFGMPLL__MPLLDIS" />
            <bitfield caption="Memory PLL Status bit" mask="0x80000000" name="MPLLRDY" values="CFGMPLL__MPLLRDY" />
         </register>
      </register-group>
      <value-group caption="Silicon Revision" name="DEVID__VER">
         <value caption="Revision A1" name="" value="0x10000000" />
         <value caption="Revision B0" name="" value="0x20000000" />
         <value caption="Revision B1" name="" value="0x30000000" />
      </value-group>
      <value-group caption="TDO Enable for 2-Wire JTAG" name="CFGCON__TDOEN">
         <value caption="2-wire JTAG protocol uses TDO" name="" value="0x1" />
         <value caption="2-wire JTAG protocol does not use TDO" name="" value="0x0" />
      </value-group>
      <value-group caption="Trace Output Enable bit" name="CFGCON__TROEN">
         <value caption="Enable trace outputs and start trace clock (trace probe must be present)" name="" value="0x1" />
         <value caption="Disable trace outputs and stop trace clock" name="" value="0x0" />
      </value-group>
      <value-group caption="JTAG Port Enable bit" name="CFGCON__JTAGEN">
         <value caption="Enable the JTAG port" name="" value="0x1" />
         <value caption="Disable the JTAG port" name="" value="0x0" />
      </value-group>
      <value-group caption="Flash ECC Configuration bits" name="CFGCON__ECCCON">
         <value caption="ECC and dynamic ECC are disabled (ECCCON bits are writable)" name="" value="0x3" />
         <value caption="ECC and dynamic ECC are disabled (ECCCON bits are locked)" name="" value="0x2" />
         <value caption="Dynamic Flash ECC is enabled (ECCCON bits are locked)" name="" value="0x1" />
         <value caption="Flash ECC is enabled (ECCCON bits are locked; disables word Flash writes)" name="" value="0x0" />
      </value-group>
