Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-DA_DFP/1.1.98/atdf/PIC32MZ2064DAG169.atdf
         <register caption="USB FIFO Data Register x (x = 0-7" name="USBFIFO5" offset="0x34" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="DATA" />
         </register>
         <register caption="USB FIFO Data Register x (x = 0-7" name="USBFIFO6" offset="0x38" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="DATA" />
         </register>
         <register caption="USB FIFO Data Register x (x = 0-7" name="USBFIFO7" offset="0x3c" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="DATA" />
         </register>
         <register caption="USB OTG Control/Status Register" name="USBOTG" offset="0x60" rw="RW" size="4">
            <bitfield caption="Active Session Control/Status bit" mask="0x00000001" name="SESSION" values="USBOTG__SESSION" />
            <bitfield caption="Host Request Control bit" mask="0x00000002" name="HOSTREQ" values="USBOTG__HOSTREQ" />
            <bitfield caption="Host Mode bit" mask="0x00000004" name="HOSTMODE" values="USBOTG__HOSTMODE" />
            <bitfield caption="Vbus Level Detection bits" mask="0x00000018" name="VBUS" values="USBOTG__VBUS" />
            <bitfield caption="Low-Speed Device Detection bit" mask="0x00000020" name="LSDEV" values="USBOTG__LSDEV" />
            <bitfield caption="Full-Speed/Hi-Speed device detection bit (" mask="0x00000040" name="FSDEV" values="USBOTG__FSDEV" />
            <bitfield caption="USB Device Type bit" mask="0x00000080" name="BDEV" values="USBOTG__BDEV" />
            <bitfield caption="RX Endpoint DMA Assertion Control bit" mask="0x00000100" name="RXEDMA" values="USBOTG__RXEDMA" />
            <bitfield caption="TX Endpoint DMA Assertion Control bit" mask="0x00000200" name="TXEDMA" values="USBOTG__TXEDMA" />
            <bitfield caption="TX Endpoint FIFO packet size bits" mask="0x000F0000" name="TXFIFOSZ" values="USBOTG__TXFIFOSZ" />
            <bitfield caption="TX Endpoint Double-packet Buffering Control bit" mask="0x00100000" name="TXDPB" values="USBOTG__TXDPB" />
            <bitfield caption="RX Endpoint FIFO Packet Size bits" mask="0x0F000000" name="RXFIFOSZ" values="USBOTG__RXFIFOSZ" />
            <bitfield caption="RX Endpoint Double-packet Buffering Control bit" mask="0x10000000" name="RXDPB" values="USBOTG__RXDPB" />
         </register>
         <register caption="USB FIFO Address Register" name="USBFIFOA" offset="0x64" rw="RW" size="4">
            <bitfield caption="Transmit Endpoint FIFO Address bits" mask="0x00001FFF" name="TXFIFOAD" values="USBFIFOA__TXFIFOAD" />
            <bitfield caption="Receive Endpoint FIFO Address bits" mask="0x1FFF0000" name="RXFIFOAD" values="USBFIFOA__RXFIFOAD" />
         </register>
         <register caption="USB Hardware Version Register" name="USBHWVER" offset="0x6c" rw="R" size="4">
            <bitfield mask="0x000003FF" name="VERMINOR" />
            <bitfield mask="0x00007C00" name="VERMAJOR" />
            <bitfield caption="Release Candidate bit" mask="0x00008000" name="RC" values="USBHWVER__RC" />
         </register>
         <register caption="USB Information Register" name="USBINFO" offset="0x78" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="TXENDPTS" />
            <bitfield mask="0x000000F0" name="RXENDPTS" />
            <bitfield mask="0x00000F00" name="RAMBITS" />
            <bitfield mask="0x0000F000" name="DMACHANS" />
            <bitfield mask="0x000F0000" name="WTID" />
            <bitfield mask="0x00F00000" name="WTCON" />
            <bitfield mask="0xFF000000" name="VPLEN" />
         </register>
         <register caption="USB End-of-Frame/Soft Reset Control Register" name="USBEOFRST" offset="0x7c" rw="RW" size="4">
            <bitfield mask="0x000000FF" name="HSEOF" />
            <bitfield mask="0x0000FF00" name="FSEOF" />
            <bitfield mask="0x00FF0000" name="LSEOF" />
            <bitfield mask="0xFF000000" name="SOFRST" />
         </register>
         <register caption="USB Endpoint 0 Transmit Address Register" name="USBE0TXA" offset="0x80" rw="RW" size="4">
            <bitfield mask="0x0000007F" name="TXFADDR" />
            <bitfield mask="0x007F0000" name="TXHUBADD" />
            <bitfield caption="TX Hub Multiple Translators bit" mask="0x00800000" name="MULTTRAN" values="USBE0TXA__MULTTRAN" />
            <bitfield mask="0x7F000000" name="TXHUBPRT" />
         </register>
         <register caption="USB Endpoint 0 Receive Address Register" name="USBE0RXA" offset="0x84" rw="RW" size="4">
            <bitfield mask="0x007F0000" name="RXHUBADD" />
            <bitfield caption="RX Hub Multiple Translators bit" mask="0x00800000" name="MULTTRAN" values="USBE0RXA__MULTTRAN" />
            <bitfield mask="0x7F000000" name="RXHUBPRT" />
         </register>
         <register caption="USB Endpoint 1 Transmit Address Register" name="USBE1TXA" offset="0x88" rw="RW" size="4">
            <bitfield mask="0x0000007F" name="TXFADDR" />
            <bitfield mask="0x007F0000" name="TXHUBADD" />
            <bitfield caption="TX Hub Multiple Translators bit" mask="0x00800000" name="MULTTRAN" values="USBE1TXA__MULTTRAN" />
            <bitfield mask="0x7F000000" name="TXHUBPRT" />
         </register>
         <register caption="USB Endpoint 1 Receive Address Register" name="USBE1RXA" offset="0x8c" rw="RW" size="4">
            <bitfield mask="0x0000007F" name="RXFADDR" />
            <bitfield mask="0x007F0000" name="RXHUBADD" />
            <bitfield caption="RX Hub Multiple Translators bit" mask="0x00800000" name="MULTTRAN" values="USBE1RXA__MULTTRAN" />
            <bitfield mask="0x7F000000" name="RXHUBPRT" />
         </register>
         <register caption="USB Endpoint 2 Transmit Address Register" name="USBE2TXA" offset="0x90" rw="RW" size="4">
            <bitfield mask="0x0000007F" name="TXFADDR" />
            <bitfield mask="0x007F0000" name="TXHUBADD" />
            <bitfield caption="TX Hub Multiple Translators bit" mask="0x00800000" name="MULTTRAN" values="USBE2TXA__MULTTRAN" />
            <bitfield mask="0x7F000000" name="TXHUBPRT" />
         </register>
